{
  "date": "042321",
  "date_string": "April 23, 2021",
  "events": [
    {
      "focus": true,
      "title": "<h3>WECE Board Applications</h3>",
      "date_time": "<h4>Deadline: April 25th at 11:59pm</h4>",
      "location": "",
      "points": "",
      "description": "Join the WECE board and head one of our committees! Our director positions are for Academic, Infrastructure, Marketing, Mentorship, Outreach, Social, and Technical committees. If you are looking to gain leadership experience, be more involved in WECE, and make a difference in the ECE community, we highly encourage you to apply! If you have any questions on what being a director is like, feel free to message any of the current directors on Slack.",
      "buttons": [
        {
          "text": "Apply",
          "link": "https://docs.google.com/document/d/1mE3lb9M6mz9__yokFEBzkIJiYGZqgdS01JH0THZN5dA/edit?fbclid=IwAR3ZtPXsTF5YsJm-KVvNxaKfdUy4_uAlcG1Q3CrX_iyMY8O492Ulc5lOmxk#heading=h.6vuxbrz4my2i"
        }
      ]
    },
    {
      "focus": true,
      "title": "<h3>WECE Hacks</h3>",
      "date_time": "<h4>May 1, 9am-9pm; Deadline to apply: <b>April 24, 11:59pm</b></h4>",
      "location": "",
      "points": "<h5>4 points</h5>",
      "description": "WECE is having our first-ever virtual hackathon focused on web development. WECE Hacks will be a day filled with workshops, mentorship, social events, team-bonding, and more! Join for our bootcamp to attend workshops and social events without submitting a project for the competition, or sign up with a team to compete in either the beginner or intermediate divisions for the hackathon. The mission of this event is to empower women in our community who might otherwise face barriers to entry in other hackathons, but we open this hackathon to all UIUC students. See you there!",
      "buttons": [
        {
          "text": "Our website",
          "link": "https://wece.ece.illinois.edu/wecehacks"
        }
      ]
    },
    {
      "focus": false,
      "title": "<h3>WECE Week: Family Feud</h3>",
      "date_time": "<h4>CORRECTION: April 30, 4-5pm</h4>",
      "location": "",
      "points": "<h5>2 points</h5>",
      "description": "After collecting student responses, we will be competing in a family feud event to see who know ECE Illinois best!",
      "buttons": []
    }
  ],
  "other_announcements": [
    {
      "title": "Resume Book",
      "description": "Looking for internships or full-time jobs? Add your resume to our WECE Resume database that we send to all our sponsors. Add it on  <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSe2FYMu-fS3zEB-byGCYTsWr8jcwMARagyIQu3EXnGJq8lybQ/viewform?usp=sf_link\" target=\"_blank\">this Google Form</a>!"
    },
    {
      "title": "Alumni Database",
      "description": "If you are an alumni, we would love to stay in contact with you! If you would like to help WECE with professional development and help our current members, please fill out <a href=\"https://forms.gle/ETuzRpH7d3fB91tp8\" target=\"_blank\">this form</a>!"
    },
    {
      "title": "Join our WECE Slack Workspace",
      "description": "WECE uses Slack as a way to streamline communication between WECE members and committees, as well as a place for important announcements and upcoming events! Join our general channel <a href=\"https://join.slack.com/t/wece-uiuc/shared_invite/zt-htevrvxw-UFc8p2zTKfp0r~qv~ho_ow\" target=\"_blank\">here</a>."
    }
  ]
}
